Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: (A generic version of these functions is defined below.)
ja: （これらの関数の総称体版は、下で定義されます）。

source: (A literal value is a value that appears directly in your source code, such as 42 and 3.14159 in the examples below.)
ja: （リテラル値「文字通りの値」は、直接あなたのソース・コードで見かける値です、例えば下の例での42と3.14159）。

source: (For more information about capturing values in a closure, see Capturing Values.)
ja: （クロージャにおいて値を捕獲することに関する詳細は、値を捕獲するを見てください。）

source: (In the swapTwoValues(_:_:) example above, T was replaced with Int the first time the function was called, and was replaced with String the second time it was called.)
ja: （上のswapTwoValues(_:_:)の例では、Tは関数が呼ばれた最初の時にIntと取り替えられて、それが呼ばれた２番目の時にStringと取り替えられました）。

source: (It can’t contain anything else, such as a Bool value or a String value.
ja: （それは、他の何か、例えばBool値またはString値などを含むことはできません。

source: (It is assumed that all media items, including all movies and songs, will have a name.)
ja: （全ての映画と歌を含む、全てのメディア項目が名前を持つと仮定されます）。

source: (Neither stylistic technique is strictly necessary, but they lead to neater code.)
ja: （文体上の技巧は絶対に必要な訳ではありません、しかしそれはすっきりしたコードにつながります。）

source: (Nested tuples are allowed.)
ja: （入れ子にされたタプルは、認められます）。

source: (Note that these type methods can access the highestUnlockedLevel type property without your needing to write it as LevelTracker.highestUnlockedLevel.)
ja: （これらの型メソッドは、あなたがそれをLevelTracker.highestUnlockedLevelと書かなくても、highestUnlockedLevel型プロパティにアクセスできる点に注意してください）。

source: (Strings have a similar optimization, but if two strings share memory, they are equal.)
ja: （文字列は同様な最適化を待ちます、しかし２つの文字列がメモリを共有するならば、それらは等しいです。）

source: (Swift reports an error at compile-time if a protocol requirement is not fulfilled.)
ja: （プロトコル要件が満たされないならば、スウィフトは実行時にエラーを報告します）。

source: (The name property is an optional String property, and so it automatically receives a default value of nil, even though this value is not written in the code.)
ja: （nameプロパティはオプショナルのStringプロパティです、なのでそれは自動的に省略時の値のnilを受け取ります、たとえこの値がそのコードに書かれないとしてもです。）

source: (The dice property is declared as a constant property because it doesn’t need to change after initialization, and the protocol only requires that it must be gettable.)
ja: （diceプロパティは定数プロパティとして宣言されます、なぜなら、それが初期化の後に変化する必要がなく、そして、プロトコルはそれが取得可能なことを必要とするだけであるからです）。

source: (The Boolean return value of advance(to:) is ignored, because the level is known to have been unlocked by the call to LevelTracker.unlock(_:) on the previous line.)
ja: （advance(to:)のブールの戻り値は無視されます、なぜなら、このレベルは前の行でLevelTracker.unlock(_:)呼び出しによってすでに錠を開けられていると分かるからです）。

source: (The examples below are based on 8-bit signed integers for simplicity, but the same principles apply for signed integers of any size.)
ja: （下の例は、単純さのために8ビット符号つき整数に基づきます、しかし同じ原理はあらゆるサイズの符号つき整数に当てはまります）。

source: (The examples of modifying an inherited property’s default value in a subclass initializer have been moved to the Initialization chapter.)
ja: （サブクラスのイニシャライザの継承されたプロパティの省略時の値を修正する例は章初期化に移動されました。）

source: (The expression number % 10 gives a value of 6 for 16, 8 for 58, and 0 for 510.)
ja: （式数number % 10は、16のために6、58のために8、510のために0の値を与えます）。

source: (The parameters to functions and closures are always constants.)
ja: （関数およびクロージャに対するパラメータは常に定数です。）

source: (The property wrapper is responsible for storing the wrapped value, so there’s no synthesized code for that.)
ja: （プロパティラッパーは、ラップ値を格納することに責任があります、それでそれに対する合成コードはありません。）

source: (The same isn’t true for structures and enumerations, because they are always copied when they are assigned to a constant or variable, or passed to a function.)
ja: （同じことは構造体と列挙にあてはまりません、なぜなら、それらが値型であって、それらが定数または変数に代入されるか関数に渡される時に、常にコピーされるからです）。

source: (This raw Int value is not used for the Jack, Queen, King, and Ace cards.)
ja: （この生のInt値は、ジャック、クイーン、キング、そしてエース・カードには使われません）。

source: (Unlike Objective-C categories, Swift extensions do not have names.)
ja: （Objective-Cカテゴリーとは異なり、スウィフト拡張には、名前がありません。）

source: // "Apple International" is not the real airport for APL, so delete it
ja: （「アップル・インターナショナル」は、APLのための本当の空港ではないので、それを削除します）

source: // "Imagination is more important than knowledge" - Einstein
ja: （「想像は知識より重要です」 - アインシュタイン）

source: // "Maple Syrup" is now the first item in the list
ja: （「メープルシロップ」が、現在はリストの最初の項目です）

source: // "Voulez-vous un café?" using LATIN SMALL LETTER E WITH ACUTE
ja: （「Voulez-vous un café?」は揚音付きラテン小文字eを使用している）

source: // "Voulez-vous un café?" using LATIN SMALL LETTER E and COMBINING ACUTE ACCENT
ja: （「Voulez-vous un café?」はラテン小文字eと揚音アクセント結合を使用している）

source: // "required" from SomeProtocol conformance; "override" from SomeSuperClass
ja: （SomeProtocol準拠からの「required」；SomeSuperClasからの「override」）

source: // 1 times 5 is 5
ja: （１かける５は、５です）

source: // 2 times 5 is 10
ja: （２かける５は、10です）

source: // 3 times 5 is 15
ja: （３かける５は、15です）

source: // 4 times 5 is 20
ja: （４かける５は、20です）

source: // 5 times 5 is 25
ja: （５かける５は、25です）

source: // A 12-sided dice
ja: （ひとつの12面のさいころ遊び）

source: // A game of Snakes and Ladders with 25 squares
ja: （25ますのヘビとはしごのゲーム）

source: // A game of Snakes and Ladders with 25 squares:
ja: （25ますのヘビとはしごのゲーム：）

source: // A hamster named Simon
ja: （サイモンという名前のハムスター）

source: // A read access from the memory where one is stored.
ja: （oneが格納されるところのメモリから読み出しアクセス。）

source: // A write access to the memory where one is stored.
ja: （oneが格納されるところのメモリに対する書き込みアクセス。）

source: // APL has now been removed from the dictionary
ja: （APLは、現在この辞書から削除されました）

source: // About to set totalSteps to 200
ja: （totalStepsを200に設定している）

source: // About to set totalSteps to 360
ja: （totalStepsを360に設定している）

source: // About to set totalSteps to 896
ja: （totalStepsを896に設定している）

source: // Added 160 steps
ja: （160の歩数が加えられた）

source: // Added 200 steps
ja: （200の歩数が加えられた）

source: // Added 536 steps
ja: （536の歩数が加えられた）

source: // All items match, so return true.
ja: （全ての項目が合致、なのでtrueを返す。）

source: // Apply f to create an array of Number instances with integer values
ja: （fを適用して整数値を持つNumberインスタンスからなる配列を作成する）

source: // Area is 12.5663708
ja: （面積は、12.5663708です）

source: // Area is 243610.0
ja: （面積は、243610.0です）

source: // AutomaticCar: traveling at 35.0 miles per hour in gear 4
ja: （AutomaticCar: 時速35.0マイル、４速ギアで運行中）

source: // Baking Powder
ja: （膨らし粉）

source: // Bananas
ja: （バナナ）

source: // Because 'fn' closes over 'index', it uses the new value
ja: （'fn'が'index'をしっかり掴むので、それは新しい値を使います）

source: // Bicycle: 2 wheel(s)
ja: （自転車: ２輪）

source: // Bicycle: traveling at 15.0 miles per hour
ja: （自転車：時速15マイルで運行中）

source: // Bind x and y to the elements of point.
ja: （xとyをpointの要素へ束縛します。）

source: // BlackjackCard properties and methods
ja: （BlackjackCardのプロパティとメソッド）

source: // Both approaches below are equivalent.
ja: （下の両方の取り組みは等しいです。）

source: // Call the underlying method directly.
ja: （基礎をなすメソッドを直接に呼び出します。）

source: // Call the underlying subscript directly.
ja: （基礎をなす添え字を直接に呼び出す。）

source: // Car: traveling at 25.0 miles per hour in gear 3
ja: （Car: ３速ギアで時速25.0マイルで運行中）

source: // Check each pair of items to see if they're equivalent.
ja: （各項目の対をそれらが等しいかどうか見るため調べる。）

source: // Check that both containers contain the same number of items.
ja: （両方のコンテナが同じ数の項目を含むことを確認する。）

source: // Convert the result to a String for long-term storage.
ja: （結果を長期保管のためのStringへ変換する。）

source: // Counting to zero:
ja: （「ゼロまで数えます：」）

source: // Do something three times.
ja: （３回何かをします。）

source: // Do the same thing using a key path.
ja: （同じことをキーパスを使って行う。）

source: // Equivalent to compoundValue = (a: 10, b: 20)
ja: （compoundValue = (a: 10, b: 20) に等しい）

source: // Error: Not enough information to infer C.
ja: （Error: Cを推論するための情報が十分でない。）

source: // Error: Protocol with associated types can't be used as a return type.
ja: （Error: 関連型を持つプロトコルは戻り型として使われることができません。）

source: // Error: conflicting access to properties of playerInformation
ja: （エラー：playerInformationのプロパティに対するアクセス衝突）

source: // Error: conflicting accesses to oscar
ja: （エラー：oscarに対するアクセス衝突）

source: // Error: conflicting accesses to playerOneScore
ja: （エラー：playerOneScoreに対するアクセス衝突）

source: // Error: conflicting accesses to stepSize
ja: （エラー：stepSizeに対するアクセス衝突）

source: // Error: redundant conformance of 'Array<Element>' to protocol 'Loggable'
ja: // エラー: プロトコル 'Loggable' に対しての 'Array<Element>' の冗長な準拠

source: // Error: redundant conformance of 'Array<Element>' to protocol 'Serializable'
ja: // エラー: プロトコル 'Serializable' に対しての 'Array<Element>' の冗長な準拠

source: // Fall back to earlier iOS and macOS APIs
ja: （以前のiOSとmacOS APIに後退する）

source: // First release
ja: （最初のリリース）

source: // Flour
ja: （小麦粉）

source: // Hello, Alex!
ja: （よろしく、アレックス！）

source: // Hello, Anna!
ja: （よろしく、アンナ！）

source: // Hello, Brian!
ja: （よろしく、ブライアン！）

source: // Hello, Jack!
ja: （よろしく、ジャック！）

source: // Hello, Michael
ja: （こんにちは、マイケル）

source: // Here's how you call this function with a trailing closure instead:
ja: （あなたが代わりに後付クロージャでどのようにこの関数を呼ぶのかがここにあります：）

source: // Here's how you call this function without using a trailing closure:
ja: （あなたが後付クロージャを使うことなくどのようにこの関数を呼ぶのかがここにあります：）

source: // Hoverboard: 0 wheel(s) in a beautiful silver
ja: （ホバーボード: ０個の車輪、美しい銀色で）

source: // If you omit the second argument when calling this function, then
ja: （あなたが２番目の引数をこの関数を呼び出すときに省略したならば、その時）

source: // In the function body, firstParameterName and secondParameterName
ja: （関数本文において、firstParameterNameとsecondParameterNameは、）

source: // In the function body, parameterName refers to the argument value
ja: （関数本文において、parameterNameは）

source: // In the implementation of a subscript...
ja: （ある添え字の実装において...）

source: // Inferred that Suffix is Stack.
ja: （SuffixはStackであると推論される。）

source: // Inferred that Suffix is Stack<Int>.
ja: （Suffix は Stack<Int>であると推論される。）

source: // Int8 cannot store a number larger than its maximum value,
ja: （Int8はその最大の値より大きい数を格納することができません）

source: // Item 1: Six eggs
ja: （項目１：６つの卵）

source: // Item 2: Milk
ja: （項目２：牛乳）

source: // Item 3: Flour
ja: （項目３：小麦粉）

source: // Item 4: Baking Powder
ja: （項目４：膨らし粉）

source: // Item 5: Bananas
ja: （項目５：バナナ）

source: // Make a local copy and manually copy it back.
ja: （ローカルコピーを作って手動でそれを元へコピーする。）

source: // Make an explicit copy.
ja: （明示的なコピーを作る。）

source: // Match only non-nil values.
ja: （nilでない値にのみマッチする。）

source: // Match using an enumeration case pattern.
ja: （列挙ケース節パターンを使っているマッチ。）

source: // Match using an optional pattern.
ja: （オプショナルパターンを使っているマッチ。）

source: // Milk
ja: （牛乳）

source: // Movie: Casablanca, dir. Michael Curtiz
ja: （映画：『カサブランカ』（監）マイケル・カーティス）

source: // Movie: Citizen Kane, dir. Orson Welles
ja: （映画：『市民ケーン』（監）オーソン・ウェルズ）

source: // Now t is (20, 20, 30)
ja: （tは、現在 (20, 20, 30)です）

source: // Operate on localX asynchronously, then wait before returning.
ja: （非同期にlocalXを処理を施す、それから返すまえに待機する。）

source: // Overload the ~= operator to match a string with an integer.
ja: （~=演算子をオーバーロードして文字列を整数と照合するようにする。）

source: // Perform a suitable setting action here.
ja: （ふさわしい設定動作をここで行う。）

source: // Person 1 is called Anna
ja: （人物は１、アンナと呼ばれる）

source: // Person 2 is called Alex
ja: （人物２は、アレックスと呼ばれる）

source: // Person 3 is called Brian
ja: （人物３は、ブライアンと呼ばれる）

source: // Person 4 is called Jack
ja: （人物４は、ジャックと呼ばれる）

source: // Prints "(1, -1) is on the line x == -y"
ja: （「(1, -1)は、x == -yの線上にある」を出力します）

source: // Prints "(1, 1) is inside the box"
ja: （「(1, 1）は、この四角の中にあります」を出力します）

source: // Prints "(1, 2) is near the origin."
ja: （「（1, 2）は原点に近いです。」を出力します）

source: // Prints "0"
ja: （「0」を出力します）

source: // Prints "10"
ja: （「10」を出力します）

source: // Prints "12"
ja: （「12」を出力します）

source: // Prints "2"
ja: （「2」を出力します）

source: // Prints "27"
ja: （「27」を出力します）

source: // Prints "3 to the power of 10 is 59049"
ja: （「３の10乗は、59049です」を出力します）

source: // Prints "325"
ja: （ "325" を出力する）

source: // Prints "6 mansion scenes; 2 cell scenes"
ja: （「６つの邸宅場面；２つの僧房場面」を出力します）

source: // Prints "6"
ja: （「6」を出力します）

source: // Prints "64"
ja: （「64」を出力します）

source: // Prints "7"
ja: （「７」を出力します）

source: // Prints "some default text"
ja: （「some default text」を出力します）

source: // Prints "<p>hello, world</p>"
ja: （「<p>よろしく、世界</p>」を出力します）

source: // Prints "A 12-sided dice"
ja: （「ひとつの12面さいころ」を出力します）

source: // Prints "A game of Snakes and Ladders with 25 squares"
ja: （「25ますのヘビとはしごのゲーム」を出力します）

source: // Prints "A hamster named Simon"
ja: （「サイモンという名前のハムスター」を出力します）

source: // Prints "A marathon is 42195.0 meters long"
ja: （「マラソンは、42195.0メートルの長さです」を出力します）

source: // Prints "A new player has joined the game with 100 coins"
ja: （「新しいプレーヤーが、100のコインを持ってゲームに参加しました」を出力します）

source: // Prints "ACCESS DENIED"
ja: （「アクセス拒否」を出力します）

source: // Prints "All items match."
ja: （「全ての項目が一致する」を出力します）

source: // Prints "An animal was initialized with a species of Giraffe"
ja: （「一匹の動物がキリンの種族で初期化された」を出力します）

source: // Prints "An implicitly unwrapped optional string."
ja: （「暗黙的にアンラップされるオプショナルの文字列。」を出力します）

source: // Prints "And another one: 0.729023776863283"
ja: （「さらにもう１つ：0.729023776863283」を出力します）

source: // Prints "And here's a random Boolean: true"
ja: （「そしてここに任意のブール: trueがあります」を出力します）

source: // Prints "Another value."
ja: （「別の値。」を出力します）

source: // Prints "Apartment 4A is being deinitialized"
ja: （「アパート4Aは、デイニシャライズされた」を出力します）

source: // Prints "Bonjour!"
ja: （「Bonjour!」を出力します）

source: // Prints "Canada's capital city is called Ottawa"
ja: （「カナダの首都はオタワです」を出力します）

source: // Prints "Card #1234567890123456 is being deinitialized"
ja: （「カード#1234567890123456は、デイニシャライズされた」を出力します）

source: // Prints "Choo Choo"
ja: （「シュッシュッ」を出力します）

source: // Prints "Collected 2 closures."
ja: （「２つのクロージャが集められた。」を出力します）

source: // Prints "Do you like cheese?"
ja: （「あなたはチーズが好きですか？」を出力します）

source: // Prints "Eww, turnips are horrible."
ja: （「うー、カブ怖い。」を出力します）

source: // Prints "Happy birthday, Malcolm, you're 21!"
ja: （「誕生日おめでとうマルコム、あなたは21です！」を出力します）

source: // Prints "Hello Jane!"
ja: （「こんにちはジェーン！」を出力します）

source: // Prints "Hello John!"
ja: （「こんにちはジョン！」を出力します）

source: // Prints "Hello again, Anna!"
ja: （「またあったね、アンナ！」を出力します）

source: // Prints "Hello again, Tim!"
ja: （「またあったね、ティム！」を出力します）

source: // Prints "Hello, Anna!"
ja: （「こんにちは、アンナ！」を出力します）

source: // Prints "Hello, Brian!"
ja: （「こんにちは、ブライアン！」を出力します）

source: // Prints "How about beets?"
ja: （「赤かぶはどう？」を出力します）

source: // Prints "I have 3 favorite music genres."
ja: （「私には大好きな音楽ジャンルが３つあります。」を出力します）

source: // Prints "I have particular music preferences."
ja: （「私には特定の音楽の好みがあります。」を出力します）

source: // Prints "I hope the weather is nice in Cupertino."
ja: （「クパチーノの天気がいいことを望むよ」を出力します）

source: // Prints "I hope the weather is nice near you."
ja: （「あなたの近くの天気がいいといいね」を出力します）

source: // Prints "Insufficient funds. Please insert an additional 2 coins."
ja: （「金額が不足しています。さらに２コイン入れてください。」を出力します）

source: // Prints "Int"
ja: （「Int」を出力します）

source: // Prints "It was not possible to print the number of rooms."
ja: （「部屋の数を出力することは、可能ではありませんでした。」を出力します）

source: // Prints "It was not possible to set the address."
ja: （「住所を設定することは、可能ではありませんでした。」を出力します）

source: // Prints "It's not that cold. Wear a t-shirt."
ja: （「そんなに寒くありません。Tシャツを着てください。」を出力します）

source: // Prints "It's really warm. Don't forget to wear sunscreen."
ja: （「非常に暖かいです。日焼け止めを塗るのを忘れないでください。」を出力します）

source: // Prints "It's too funky in here."
ja: （「そりゃここじゃfunkyすぎる。」を出力します）

source: // Prints "It's very cold. Consider wearing a scarf."
ja: （「非常に寒いです。スカーフを巻くことを考えてください。 」を出力します）

source: // Prints "Item: sock, quantity: 2"
ja: （「項目：靴下、数量：２」を出力します）

source: // Prints "John Appleseed is being deinitialized"
ja: （「John Appleseedは、デイニシャライズされた」を出力します）

source: // Prints "John Appleseed is being initialized"
ja: （「John Appleseedは、初期化された」を出力します）

source: // Prints "John's building identifier begins with "The"."
ja: （「ジョンの建物名は「月」で始まります」を出力します）

source: // Prints "John's building identifier is The Larches."
ja: （「ジョンの建物名は月桂樹です」を出力します）

source: // Prints "John's residence has 1 room(s)."
ja: （「ジョンの邸宅には１部屋ある」を出力します）

source: // Prints "John's street name is Laurel Street."
ja: （「ジョンの街路名は月桂樹通りです」を出力します）

source: // Prints "Made an index"
ja: （"Made an index" を出力します）

source: // Prints "Media library contains 2 movies and 3 songs"
ja: （「情報媒体書庫は、２つの映画と３つの歌を含みます」を出力します）

source: // Prints "Mostly harmless"
ja: （「おおむね無害」を出力します）

source: // Prints "Nothing to see here"
ja: （「ここで見るものは何も無し」を出力します）

source: // Prints "Now serving Alex!"
ja: （今アレックスに対応中！）

source: // Prints "Now serving Barry!"
ja: （今バリーに対応中！）

source: // Prints "Now serving Daniella!"
ja: （今ダニエラに対応中！）

source: // Prints "Now serving Ewa!"
ja: （今エヴァに対応中！）

source: // Prints "On an axis, 9 from the origin"
ja: （「ある軸上で、原点から９」を出力します）

source: // Prints "One inch is 0.0254 meters"
ja: （「１インチは、0.0254メートルです」を出力します）

source: // Prints "PlayerOne has left the game"
ja: （「PlayerOneは、ゲームを離れました」を出力します）

source: // Prints "PlayerOne won 2000 coins & now has 2100 coins"
ja: （「PlayerOneは2000のコインを獲得＆現在2100のコインを持ちます」を出力します）

source: // Prints "QR code: ABCDEFGHIJKLMNOP."
ja: （「QRコード：ABCDEFGHIJKLMNOP。」を出力します）

source: // Prints "Result: 5"
ja: （「結果：５」を出力します）

source: // Prints "Result: 6"
ja: （「結果：６」を出力します）

source: // Prints "Result: 8"
ja: （「結果：８」を出力します）

source: // Prints "Rock? I'm over it."
ja: （「Rock？ もう済んだことさ（曲名？）。」を出力します）

source: // Prints "Some value."
ja: （「ある値。」を出力します）

source: // Prints "SomeSubClass"
ja: （「 SomeSubClass 」を出力します）

source: // Prints "The airports dictionary contains 2 items."
ja: （「airports辞書は２項目を含む。」を出力します）

source: // Prints "The airports dictionary is not empty."
ja: （「airports辞書は空ではない。」を出力します）

source: // Prints "The anonymous creature could not be initialized"
ja: （「不明な生き物は初期化されることができませんでした」を出力します）

source: // Prints "The bank now has 10000 coins"
ja: （「胴元には現在10000コインがあります」を出力します）

source: // Prints "The bank now only has 7900 coins left"
ja: （「胴元には現在7900個のコインだけが残っています」を出力します）

source: // Prints "The current value of friendlyWelcome is Bonjour!"
ja: （「The current value of friendlyWelcome is Bonjour!」を出力します）

source: // Prints "The default temperature is 32.0° Fahrenheit"
ja: （「省略時の温度は華氏32.0°です」を出力します）

source: // Prints "The first number is 10."
ja: （「最初の数は、10です。」を出力します）

source: // Prints "The first room name is Living Room."
ja: （「最初の部屋名は、居間です。」を出力します）

source: // Prints "The frameRate property of tenEighty is now 30.0"
ja: （「tenEightyのframeRateプロパティは、現在は30.0です」を出力します）

source: // Prints "The index of llama is 2"
ja: （「ラマのインデックスは、２です」を出力します）

source: // Prints "The integer value of 三 is 3."
ja: （「三の整数値は３です。」を出力します）

source: // Prints "The name of the airport is Dublin Airport."
ja: （「空港名は「ダブリン空港です。」を出力します）

source: // Prints "The number 5 is a prime number, and also an integer."
ja: （「数５は素数で、そのうえ整数です。」を出力します）

source: // Prints "The number of edits is 3"
ja: （「編集数は、３です」を出力します）

source: // Prints "The old value for DUB was Dublin."
ja: （「DUBの古い値は「ダブリンでした。」を出力します）

source: // Prints "The point is at (1, 2)."
ja: （「pointは（1, 2）です」を出力します）

source: // Prints "The point is at (3, 2)."
ja: （「pointは（3, 2）です。」を出力します）

source: // Prints "The point is now at (3.0, 4.0)"
ja: （「ポイントは現在は(3.0, 4.0)です」を出力します）

source: // Prints "The removed airport's name is Dublin Airport."
ja: （「削除された空港の名前はダブリンです。」を出力します）

source: // Prints "The second number is 42."
ja: （２番目の数は、42です。」を出力します）

source: // Prints "The shopping list contains 2 items."
ja: （「買い物リストは２つの項目を含みます。」を出力します）

source: // Prints "The shopping list is not empty."
ja: （「買い物リストは空ではありません。」を出力します）

source: // Prints "The status code is 200"
ja: （「状態コードは200です」を出力します）

source: // Prints "The status code is 404"
ja: （「状態コードは404です」を出力します）

source: // Prints "The status message is Not Found"
ja: （「状態メッセージが見つかりません」を出力します）

source: // Prints "The status message is OK"
ja: （「状態メッセージはOKです」を出力します）

source: // Prints "The top item on the stack is tres."
ja: （「このスタックの一番上の項目はtresです」を出力します）

source: // Prints "The width of someResolution is 0"
ja: （「someResolutionの幅は0です」を出力します）

source: // Prints "The width of someVideoMode is 0"
ja: （「someVideoModeの幅は0です」を出力します）

source: // Prints "The width of someVideoMode is now 1280"
ja: （「someVideoModeの幅は、現在は1280です」を出力します）

source: // Prints "There are 5 scenes in Act 1"
ja: （「５つの場面が一幕にあります」を出力します）

source: // Prints "There are dozens of moons orbiting Saturn."
ja: （「土星の軌道を回るたくさんの月がある。」を出力します）

source: // Prints "There are now 9900 coins left in the bank"
ja: （「現在9900個のコインが胴元に残されます」を出力します）

source: // Prints "There isn't a planet at position 11"
ja: （「位置11に惑星は存在しない」を出力します）

source: // Prints "These two characters are not equivalent."
ja: （「これら２つの文字列は等しくない。」を出力します）

source: // Prints "These two strings are considered equal"
ja: （「これら２つの文字列は等しいと考えられる」を出力します）

source: // Prints "These two vectors are also equivalent."
ja: （「これらの２つのベクトルはまた等しいです。」を出力します）

source: // Prints "These two vectors are equivalent."
ja: （「これらの２つのベクトルは等しいです。」を出力します）

source: // Prints "This is a defined temperature unit, so initialization succeeded."
ja: （「これは定義済み温度単位です、なので初期化は成功しました。」を出力します）

source: // Prints "This is not a defined temperature unit, so initialization failed."
ja: （「これは定義済み温度単位ではありません、なので初期化は失敗しました。」を出力します」）

source: // Prints "This point is to the right of the line where x == 1.0"
ja: （「この点は線x == 1.0の右にある」を出力します）

source: // Prints "Three feet is 0.914399970739201 meters"
ja: （「３フィートは、0.914399970739201メートルです」を出力します）

source: // Prints "Unable to initialize one unnamed product"
ja: （「１個の名前のない製品を初期化できません」を出力します）

source: // Prints "Unable to initialize zero shirts"
ja: （「０個のシャツを初期化できません」を出力します）

source: // Prints "Unable to retrieve the address."
ja: （「住所を取り出すことができない」を出力します）

source: // Prints "Unable to retrieve the first room name."
ja: （「最初の部屋名を取り戻すことができない」を出力します）

source: // Prints "Unable to retrieve the number of rooms."
ja: （「部屋の数を取り出すことができない」を出力します）

source: // Prints "Watch out for penguins"
ja: （「ペンギンに気をつけろ」を出力します）

source: // Prints "Welcome!"
ja: （「歓迎します！」を出力します）

source: // Prints "cinema is now 2048 pixels wide"
ja: （「cinemaは、現在2048のピクセルの幅です」を出力します）

source: // Prints "convertedNumber contains some integer value."
ja: （「convertedNumberは、何らかの整数値を持ちます」を出力します）

source: // Prints "convertedNumber has an integer value of 123."
ja: （「convertedNumberは、整数値123を持ちます」を出力します）

source: // Prints "data.txt"
ja: （「data.txt」を出力します）

source: // Prints "e is a vowel"
ja: （「eは、母音です」を出力します）

source: // Prints "false"
ja: （「false」を出力します）

source: // Prints "hd is still 1920 pixels wide"
ja: （「hdは、依然として1920のピクセルの幅です」を出力します）

source: // Prints "hello, world"
ja: （「よろしく、世界」を出力ます）

source: // Prints "hello, world", because name is indeed equal to "world".
ja: （「hello, world」を出力します、nameが確かに「world」と等しいので。）

source: // Prints "highest unlocked level is now 2"
ja: （「最も高い鍵の開いたレベルは現在２です」を出力します）

source: // Prints "letters is of type Set<Character> with 0 items."
ja: （「lettersは型Set<Character>で０項目を持ちます。」を出力します）

source: // Prints "level 6 has not yet been unlocked"
ja: （「レベル６はまだ開錠されていません」を出力します）

source: // Prints "min is -6 and max is 109"
ja: （「最小は-6で、最大は109です」を出力します）

source: // Prints "on the x-axis with an x value of 2"
ja: （「２のxの値でx-軸の上」を出力します）

source: // Prints "p is being deinitialized"
ja: （「pは、デイニシャライズされている」を出力します）

source: // Prints "six times three is 18"
ja: （「６かける３は18です」を出力します）

source: // Prints "someInt is now 107, and anotherInt is now 3"
ja: （「someIntは今は107、anotherIntは今は３です」を出力します）

source: // Prints "someInts is of type [Int] with 0 items."
ja: （「someIntsは型[Int]で0項目を持ちます。」を出力します）

source: // Prints "square.origin is now at (10.0, 10.0)"
ja: （「square.originは、現在(10.0, 10.0)です」を出力します））

source: // Prints "tenEighty and alsoTenEighty refer to the same VideoMode instance."
ja: （「tenEightyとalsoTenEightyは、同じVideoModeインスタンスに言及します。」を出力します）

source: // Prints "the number of characters in cafe is 4"
ja: （「cafeの文字数は4です」を出力します）

source: // Prints "the number of characters in café is 4"
ja: （「caféの文字数は4です」を出力します）

source: // Prints "the volume of fourByFiveByTwo is 40.0"
ja: （「fourByFiveByTwoのボリュームは、40.0です」を出力します）
